# RoofMeetsRoofTangentially Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..RoofMeetsRoofTangentially Property
BuiltInFailures..::..RoofFailures Class See Also
---
The roofs cannot be joined because the roof being joined meets the target roof tangentially.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoofMeetsRoofTangentially { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoofMeetsRoofTangentially As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoofMeetsRoofTangentially {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace